{
  "general_testimonials": [
    {
      "author": "Michelle",
      "text": "I’ve done yoga before, but nothing like this. The way MAHA weaves breath, movement, kriya and meditation feels so much deeper than anything else I have tried before. Each day MAHA 21 brought me closer to myself. I cried. I laughed. I softened. I opened. I remembered how to love myself again. This is the kind of work the world needs more of."
    },
    {
      "author": "Amber",
      "text": "Low key it will change your life"
    },
    {
      "author": "Paul",
      "text": "The whole experience, the MAHA Method, it just worked, my experience was way better than I could have imagined. I love what MAHA Collective stands for."
    },
    {
      "author": "Diane",
      "text": "Alessandra has a presence about her… Her energy has the ability to transform."
    },
    {
      "author": "Joanna",
      "text": "I loved the progression from start to finish. Alessandra’s voice and presence made me feel so safe. I was able to reach a place so deep within and I will be forever grateful to you for that."
    },
    {
      "author": "Imogen",
      "text": "Everyone needs to try the MAHA Method, it enlivens your day and your mind. What a way to live with the MAHA Method - Thank you!"
    },
    {
      "author": "Kate",
      "text": "I felt Alessandra’s guidance and love throughout the process, she gave me strength to reach new levels within myself, unlock emotions and breathe. I feel this experience has unlocked a deeper sense of being a purpose in me. Thank you"
    },
    {
      "author": "Shara",
      "text": "What you offer is an absolute highlight. Best class of the week"
    },
    {
      "author": null,
      "text": "Beyond incredible, I’ve never felt and seen the stuff I did in Savasana, I had to hold back laughter because I was so full of joy… seriously incredible…."
    },
    {
      "author": "Dean",
      "text": "Practicing with you is my Sunday church. I will never miss a class with Alessandra, what you offer is like nothing else I’ve experienced before."
    },
    {
      "author": "Giorgia",
      "text": "Every part of the MAHA experience feels intentional. The music, the energy, the words. It’s like therapy for the soul, but embodied. This is what true healing feels like."
    },
    {
      "author": "Emma",
      "text": "The MAHA Method is the way"
    },
    {
      "author": "Toula",
      "text": "Alessandra and The MAHA Method helped me trust myself again. In my body, in my path, in life. That is a gift I will never forget."
    }
  ],
  "maha_21_testimonials": [
    {
      "author": "Dean",
      "text": "Maha 21 was a profound journey for me. I’ve struggled with anxiety and self-doubt for years, and it often felt like I was stuck in my head, disconnected from my heart. The consistent daily practice created space for me to slow down, breathe, and truly feel. I began to notice self-love that I hadn’t experienced before. I feel more peaceful, more grounded, and more open to love in all its forms."
    },
    {
      "author": "Sarah",
      "text": "I was in a really low place, recovering from illness, barely moving, and with no energy or desire to even leave the house. Since practising MAHA 21 with Alessandra, everything has shifted. I feel energised, alive, and inspired to live fully again. You’ve given me back my vitality."
    },
    {
      "author": "Jesse",
      "text": "Maha 21 truly transformed my life. The time I invested felt nothing compared to the rewards I received. This practice opened my eyes to what truly matters. After completing Maha 21, I found the courage to make the changes I’d been avoiding for years such as quitting my job and putting myself first. It gave me the clarity and strength to live a life that feels authentic and deeply fulfilling."
    },
    {
      "author": "Maria",
      "text": "Maha 21 brought me so much peace. My mind was less busy. I feel stronger and happier than ever before. Thank you Alessandra"
    },
    {
      "author": "Sophie",
      "text": "Before Maha 21, I felt so guarded like my heart was wrapped in layers of protection. I longed to open but didn’t know how. This program was exactly what I needed. The daily practice of breath, movement, and meditation gently softened those walls. Over the 21 days, I noticed a beautiful shift: old emotional heaviness began to lift, and I found myself more present, more connected not only to myself but to those around me. It felt like coming home to a part of me I had forgotten. I’m deeply grateful for this experience and would recommend it to anyone ready to open their heart and live more fully from love."
    },
    {
      "author": "Tali",
      "text": "MAHA 21 helped me trust myself again. That is a gift I will never forget. I can't thank Alessandra enough."
    },
    {
      "author": "Sharon",
      "text": "There’s something magnetic about MAHA. It’s not just movement, it’s a way of living. I’m seeing the world differently now, more colour, more connection, more me."
    },
    {
      "author": "Tom",
      "text": "MAHA felt like a homecoming. I’ve tried so many practices over the years, but this… this touched something deeper. I left feeling clear, expanded, and full of love."
    },
    {
      "author": "Amy",
      "text": "There’s a depth to MAHA that’s hard to put into words. It’s like it speaks directly to your soul. After just one session, I knew I’d found something truly special."
    },
    {
      "author": "Ella",
      "text": "The combination of breath, movement, and meditation opened a new doorway inside me. I feel so much calmer, more connected to myself and the world around me, and ready to receive the love I deserve. I feel indebted with gratitude to MAHA Collective, thank you Alessandra"
    },
    {
      "author": "Emma",
      "text": "What a profound experience. The maha way of living allows you to come home to your true self, your authentic self. The visualisation of seeing myself and saying ‘thank you i love you” felt like a warm hug. The self compassion and gratitude I felt in that moment was unmatched. I can't wait to continue this, step into my higher self and give back with my love."
    }
  ]
}
